In [4]:
import numpy as np
import seaborn as sns
import pandas as pd

In [10]:
df = pd.DataFrame(np.random.randint(0,100,size=(100, 4)), columns=['SMA','CPS','Solar Edge','ABB'])

In [11]:
df.head()

   SMA  CPS  Solar Edge  ABB
0   12   22          70   34
1    0   42          28   85
2   27   61          28   66
3   87   24          37   33
4   36   37          51   15

In [14]:
df.describe()

              SMA         CPS  Solar Edge         ABB
count  100.000000  100.000000  100.000000  100.000000
mean    45.890000   45.400000   49.390000   48.730000
std     28.125223   27.569929   28.249571   28.471802
min      0.000000    0.000000    0.000000    1.000000
25%     24.750000   23.750000   27.000000   24.000000
50%     42.000000   45.000000   49.000000   48.000000
75%     65.500000   70.000000   71.500000   70.250000
max     97.000000   98.000000   99.000000   97.000000